CSI API ETABS v1
cCaseResponseSpectrum.GetDampProportional Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDampProportional(
	string Name,
	ref int DampType,
	ref double DampA,
	ref double DampB,
	ref double DampF1,
	ref double DampF2,
	ref double DampD1,
	ref double DampD2
)
Function GetDampProportional (
	Name As String,
	ByRef DampType As Integer,
	ByRef DampA As Double,
	ByRef DampB As Double,
	ByRef DampF1 As Double,
	ByRef DampF2 As Double,
	ByRef DampD1 As Double,
	ByRef DampD2 As Double
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim DampType As Integer
Dim DampA As Double
Dim DampB As Double
Dim DampF1 As Double
Dim DampF2 As Double
Dim DampD1 As Double
Dim DampD2 As Double
Dim returnValue As Integer
returnValue = instance.GetDampProportional(Name,
	DampType, DampA, DampB, DampF1, DampF2,
	DampD1, DampD2)
int GetDampProportional(
	String^ Name,
	int% DampType,
	double% DampA,
	double% DampB,
	double% DampF1,
	double% DampF2,
	double% DampD1,
	double% DampD2
)
abstract GetDampProportional :
        Name : string *
        DampType : int byref *
        DampA : float byref *
        DampB : float byref *
        DampF1 : float byref *
        DampF2 : float byref *
        DampD1 : float byref *
        DampD2 : float byref -> int
Parameters
Name
Type: System.String
DampType
Type: System.Int32
DampA
Type: System.Double
DampB
Type: System.Double
DampF1
Type: System.Double
DampF2
Type: System.Double
DampD1
Type: System.Double
DampD2
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace